qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
/**
 * @brief   USART2 clock derived enable state.
 */
#define STM32_USART2_ENABLED                (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_USART2 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_USART2 == TRUE)))

/**
 * @brief   USART3 clock derived enable state.
 */
#define STM32_USART3_ENABLED                (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_USART3 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_USART3 == TRUE)))

/**
 * @brief   UART4 clock derived enable state.
 */
#define STM32_UART4_ENABLED                 (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_UART4 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_UART4 == TRUE)))

/**
 * @brief   UART5 clock derived enable state.
 */
#define STM32_UART5_ENABLED                 (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_UART5 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_UART5 == TRUE)))

/**
 * @brief   LPUART1 clock derived enable state.
 */
#define STM32_LPUART1_ENABLED               (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_LPUART1 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_LPUART1 == TRUE)))

/**
 * @brief   I2C1 clock derived enable state.
 */
#define STM32_I2C1_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C1 == TRUE)))

/**
 * @brief   I2C2 clock derived enable state.
 */
#define STM32_I2C2_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C2 == TRUE)))

/**
 * @brief   I2C4 clock derived enable state.
 */
#define STM32_I2C4_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C4 == TRUE)))

/**
 * @brief   I2C3 clock derived enable state.
 */
#define STM32_I2C3_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C3 == TRUE)))

/**
 * @brief   SPI1 clock derived enable state.
 */
#define STM32_SPI1_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI1 == TRUE)))

/**
 * @brief   SPI2 clock derived enable state.
 */
#define STM32_SPI2_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI2 == TRUE)))

/**
 * @brief   SPI3 clock derived enable state.
 */
#define STM32_SPI3_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI3 == TRUE)))

/**
 * @brief   FDCAN1 clock derived enable state.
 */
#define STM32_FDCAN1_ENABLED                (((HAL_USE_CAN == TRUE) &&      \
                                              (STM32_CAN_USE_FDCAN1 == TRUE)))

/**
 * @brief   HCLKDIV8 clock derived enable state.
 */
#define STM32_HCLKDIV8_ENABLED              (((STM32_SYSTICK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8)))

/**
 * @brief   SYSTICK clock derived enable state.
 */
#define STM32_SYSTICK_ENABLED               ((OSAL_ST_MODE == OSAL_ST_MODE_PERIODIC))

/**
 * @brief   TIM16IC clock derived enable state.
 */
#define STM32_TIM16IC_ENABLED               TRUE

/**
 * @brief   TIM17IC clock derived enable state.
 */
#define STM32_TIM17IC_ENABLED               TRUE

/**
 * @brief   LPTIM2IC clock derived enable state.
 */
#define STM32_LPTIM2IC_ENABLED              TRUE

/**
 * @brief   ICLK clock derived enable state.
 */
#define STM32_ICLK_ENABLED                  ((STM32_USB_ENABLED == TRUE) || \
                                             ((STM32_SDMMC_ENABLED == TRUE) && \
                                              (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)))

/**
 * @brief   USB clock derived enable state.
 */
#define STM32_USB_ENABLED                   (((HAL_USE_USB == TRUE) &&      \
                                              (STM32_USB_USE_USB1 == TRUE)))

/**
 * @brief   SDMMC clock derived enable state.
 */
#define STM32_SDMMC_ENABLED                 ((STM32_SDMMC1_ENABLED == TRUE) || \
                                             (STM32_SDMMC2_ENABLED == TRUE))

/**
 * @brief   SDMMC1 clock derived enable state.
 */
#define STM32_SDMMC1_ENABLED                (((HAL_USE_SDC == TRUE) &&      \
                                              (STM32_SDC_USE_SDMMC1 == TRUE)))

/**
 * @brief   SDMMC2 clock derived enable state.
 */
#define STM32_SDMMC2_ENABLED                (((HAL_USE_SDC == TRUE) &&      \
                                              (STM32_SDC_USE_SDMMC2 == TRUE)))

/**
 * @brief   OCTOSPI clock derived enable state.
 */
#define STM32_OCTOSPI_ENABLED               ((defined(STM32_WSPI_USE_OCTOSPI1) && \
                                              (HAL_USE_WSPI == TRUE) &&     \
                                              (STM32_WSPI_USE_OCTOSPI1 == TRUE)) || \
                                             (defined(STM32_WSPI_USE_OCTOSPI2) && \
                                              (HAL_USE_WSPI == TRUE) &&     \
                                              (STM32_WSPI_USE_OCTOSPI2 == TRUE)))

/**
 * @brief   HSI48DIV2 clock derived enable state.
 */
#define STM32_HSI48DIV2_ENABLED             (((STM32_RNG_ENABLED == TRUE) && \
                                              (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48DIV2)))

/**
 * @brief   RNG clock derived enable state.
 */
#define STM32_RNG_ENABLED                   (((HAL_USE_TRNG == TRUE) &&     \
                                              (STM32_TRNG_USE_RNG1 == TRUE)))

/**
 * @brief   SAI1 clock derived enable state.
 */
#define STM32_SAI1_ENABLED                  ((defined(STM32_I2S_USE_SAI1) && \
                                              (HAL_USE_I2S == TRUE) &&      \
                                              (STM32_I2S_USE_SAI1 == TRUE)))

/**
 * @brief   SAI2 clock derived enable state.
 */
#define STM32_SAI2_ENABLED                  ((defined(STM32_I2S_USE_SAI2) && \
                                              (HAL_USE_I2S == TRUE) &&      \
                                              (STM32_I2S_USE_SAI2 == TRUE)))

/**
 * @brief   MDF1 clock derived enable state.
 */
#define STM32_MDF1_ENABLED                  ((STM32_CFG_MDF1_REQUIRED == TRUE))

/**
 * @brief   ADF1 clock derived enable state.
 */
#define STM32_ADF1_ENABLED                  ((STM32_CFG_ADF1_REQUIRED == TRUE))

/**
 * @brief   ADCDAC clock derived enable state.
 */
#define STM32_ADCDAC_ENABLED                (((HAL_USE_ADC == TRUE) &&      \
                                              ((STM32_ADC_USE_ADC1 == TRUE) || \
                                               (defined(STM32_ADC_USE_ADC4) && \
                                                (STM32_ADC_USE_ADC4 == TRUE)))) || \
                                             ((HAL_USE_DAC == TRUE) &&      \
                                              ((STM32_DAC_USE_DAC1_CH1 == TRUE) || \
                                               (STM32_DAC_USE_DAC1_CH2 == TRUE))))

/**
 * @brief   DAC1SH clock derived enable state.
 */
#define STM32_DAC1SH_ENABLED                ((STM32_CFG_DAC1SH_REQUIRED == TRUE))

/**
 * @brief   LPTIM1 clock derived enable state.
 */
#define STM32_LPTIM1_ENABLED                ((STM32_CFG_LPTIM1_REQUIRED == TRUE))

/**
 * @brief   LPTIM2 clock derived enable state.
 */
#define STM32_LPTIM2_ENABLED                ((STM32_CFG_LPTIM2_REQUIRED == TRUE))

/**
 * @brief   LPTIM34 clock derived enable state.
 */
#define STM32_LPTIM34_ENABLED               ((STM32_CFG_LPTIM34_REQUIRED == TRUE))

/**
 * @brief   IWDG clock derived enable state.
 */
#define STM32_IWDG_ENABLED                  (((HAL_USE_WDG == TRUE) &&      \
                                              (STM32_WDG_USE_IWDG == TRUE)))

/*--- Macros and checks for the NONE clock point. --------------------------*/

/**
 * @brief   NONE nominal source frequency.
 */
#define STM32_NONE_SOURCE_FREQ              0U

/**
 * @brief   NONE clock register bits.
 */
#define STM32_NONE_BITS                     0U

/**
 * @brief   Pseudo-clock for disabled sources clock point.
 */
#define STM32_NONE_FREQ                     0U

/*--- Macros and checks for the AUDIOCLK clock point. ----------------------*/

/**
 * @brief   AUDIOCLK nominal source frequency.
 */
#define STM32_AUDIOCLK_SOURCE_FREQ          STM32_CFG_AUDIOCLK

/**
 * @brief   AUDIOCLK clock register bits.
 */
#define STM32_AUDIOCLK_BITS                 0U

/**
 * @brief   External audio clock clock point.
 */
#define STM32_AUDIOCLK_FREQ                 STM32_AUDIOCLK_SOURCE_FREQ

/*--- Macros and checks for the HSI16 clock point. -------------------------*/

