qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_PLL3P_VALUE >= 1) && (STM32_CFG_PLL3P_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3P_VALUE value specified"
#endif

/**
 * @brief   PLL3P clock register bits.
 */
#if (STM32_PLL3P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3P_BITS                  ((STM32_CFG_PLL3P_VALUE -       \
                                              1U) << RCC_PLL3DIVR_PLL3P_Pos)
#else
  #define STM32_PLL3P_BITS                  0U
#endif

/**
 * @brief   PLL3 P output clock clock point.
 */
#if (STM32_PLL3P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3P_FREQ                  (STM32_PLL3VCO_FREQ /           \
                                             STM32_CFG_PLL3P_VALUE)
#else
  #define STM32_PLL3P_FREQ                  0U
#endif

#if !((STM32_PLL3P_ENABLED != TRUE) || (STM32_PLL3P_FREQ >= STM32_PLLP_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3P_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3P_ENABLED != TRUE) || (STM32_PLL3P_FREQ <= STM32_PLLP_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3P_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PLL3Q clock point. -------------------------*/

#if !((STM32_CFG_PLL3Q_VALUE >= 1) && (STM32_CFG_PLL3Q_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3Q_VALUE value specified"
#endif

/**
 * @brief   PLL3Q clock register bits.
 */
#if (STM32_PLL3Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3Q_BITS                  ((STM32_CFG_PLL3Q_VALUE -       \
                                              1U) << RCC_PLL3DIVR_PLL3Q_Pos)
#else
  #define STM32_PLL3Q_BITS                  0U
#endif

/**
 * @brief   PLL3 Q output clock clock point.
 */
#if (STM32_PLL3Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3Q_FREQ                  (STM32_PLL3VCO_FREQ /           \
                                             STM32_CFG_PLL3Q_VALUE)
#else
  #define STM32_PLL3Q_FREQ                  0U
#endif

#if !((STM32_PLL3Q_ENABLED != TRUE) || (STM32_PLL3Q_FREQ >= STM32_PLLQ_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3Q_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3Q_ENABLED != TRUE) || (STM32_PLL3Q_FREQ <= STM32_PLLQ_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3Q_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PLL3R clock point. -------------------------*/

#if !((STM32_CFG_PLL3R_VALUE >= 1) && (STM32_CFG_PLL3R_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3R_VALUE value specified"
#endif

/**
 * @brief   PLL3R clock register bits.
 */
#if (STM32_PLL3R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3R_BITS                  ((STM32_CFG_PLL3R_VALUE -       \
                                              1U) << RCC_PLL3DIVR_PLL3R_Pos)
#else
  #define STM32_PLL3R_BITS                  0U
#endif

/**
 * @brief   PLL3 R output clock clock point.
 */
#if (STM32_PLL3R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3R_FREQ                  (STM32_PLL3VCO_FREQ /           \
                                             STM32_CFG_PLL3R_VALUE)
#else
  #define STM32_PLL3R_FREQ                  0U
#endif

#if !((STM32_PLL3R_ENABLED != TRUE) || (STM32_PLL3R_FREQ >= STM32_PLLR_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3R_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3R_ENABLED != TRUE) || (STM32_PLL3R_FREQ <= STM32_PLLR_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3R_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the SYSCLK clock point. ------------------------*/

/**
 * @brief   SYSCLK clock register bits.
 */
#if (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS) || defined(__DOXYGEN__)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_MSIS
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_HSI16
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_HSE
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_PLL1P)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_PLL1P
#else
  #error "invalid STM32_CFG_SYSCLK_SEL value specified"
#endif

/**
 * @brief   System clock clock point.
 */
#if ((STM32_SYSCLK_ENABLED == TRUE) && \
     (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) || \
    defined(__DOXYGEN__)
  #define STM32_SYSCLK_FREQ                 STM32_MSIS_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16)
  #define STM32_SYSCLK_FREQ                 STM32_HSI16_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE)
  #define STM32_SYSCLK_FREQ                 STM32_HSE_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_PLL1P)
  #define STM32_SYSCLK_FREQ                 STM32_PLL1P_FREQ
#else
  #define STM32_SYSCLK_FREQ                 0U
#endif

#if !defined(RCC_CFGR1_SW_MSIS) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_MSIS not defined"
#endif
#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) ||                       \
     (STM32_MSIS_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16)) ||                      \
     (STM32_HSI16_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE)) ||                        \
     (STM32_HSE_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

#if !defined(RCC_CFGR1_SW_PLL1P) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_PLL1P not defined"
#endif
#if !(!((STM32_SYSCLK_ENABLED == TRUE) &&                                   \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_PLL1P)) ||                      \
     (STM32_PLL1P_FREQ <= STM32_SYSCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SYSCLK_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the HCLK clock point. --------------------------*/

/**
 * @brief   HCLK clock register bits.
 */
#if (STM32_CFG_HCLK_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV1
#elif (STM32_CFG_HCLK_VALUE == 2)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV2
#elif (STM32_CFG_HCLK_VALUE == 4)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV4
#elif (STM32_CFG_HCLK_VALUE == 8)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV8
#elif (STM32_CFG_HCLK_VALUE == 16)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV16
#elif (STM32_CFG_HCLK_VALUE == 64)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV64
#elif (STM32_CFG_HCLK_VALUE == 128)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV128
#elif (STM32_CFG_HCLK_VALUE == 256)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV256
#elif (STM32_CFG_HCLK_VALUE == 512)
  #define STM32_HCLK_BITS                   RCC_CFGR2_HPRE_DIV512
#else
  #error "invalid STM32_CFG_HCLK_VALUE value specified"
#endif

/**
 * @brief   AHB clock clock point.
 */
#define STM32_HCLK_FREQ                     (STM32_SYSCLK_FREQ /            \
                                             STM32_CFG_HCLK_VALUE)

#if !((STM32_HCLK_ENABLED != TRUE) || (STM32_HCLK_FREQ <= STM32_HCLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HCLK_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK1 clock point. -------------------------*/

/**
 * @brief   PCLK1 clock register bits.
 */
#if (STM32_CFG_PCLK1_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV1
#elif (STM32_CFG_PCLK1_VALUE == 2)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV2
#elif (STM32_CFG_PCLK1_VALUE == 4)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV4
#elif (STM32_CFG_PCLK1_VALUE == 8)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV8
#elif (STM32_CFG_PCLK1_VALUE == 16)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV16
#else
  #error "invalid STM32_CFG_PCLK1_VALUE value specified"
#endif

/**
 * @brief   APB1 clock clock point.
 */
#define STM32_PCLK1_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK1_VALUE)

