qmk/ChibiOS/os/hal/ports/STM32/STM32U5xx/clocktree.h
/*--- Macros and checks for the SPI2 clock point. --------------------------*/

/**
 * @brief   SPI2 clock register bits.
 */
#if (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_PCLK1
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#elif (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_SYSCLK)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_SYSCLK
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#elif (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_HSI16)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_HSI16
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#elif (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_MSIK
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SPI2_SEL value specified"
#endif

/**
 * @brief   SPI2 clock clock point.
 */
#if ((STM32_SPI2_ENABLED == TRUE) && \
     (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_SPI2_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_SPI2_ENABLED == TRUE) && \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_SYSCLK)
  #define STM32_SPI2_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_SPI2_ENABLED == TRUE) && \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_HSI16)
  #define STM32_SPI2_FREQ                   STM32_HSI16_FREQ
#elif (STM32_SPI2_ENABLED == TRUE) && \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)
  #define STM32_SPI2_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_SPI2_FREQ                   0U
#endif

/*--- Macros and checks for the SPI3 clock point. --------------------------*/

/**
 * @brief   SPI3 clock register bits.
 */
#if (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_PCLK3) || defined(__DOXYGEN__)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR3_SPI3SEL_PCLK3
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#elif (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_SYSCLK)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR3_SPI3SEL_SYSCLK
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#elif (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_HSI16)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR3_SPI3SEL_HSI16
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#elif (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_MSIK)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR3_SPI3SEL_MSIK
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SPI3_SEL value specified"
#endif

/**
 * @brief   SPI3 clock clock point.
 */
#if ((STM32_SPI3_ENABLED == TRUE) && \
     (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_PCLK3)) || \
    defined(__DOXYGEN__)
  #define STM32_SPI3_FREQ                   STM32_PCLK3_FREQ
#elif (STM32_SPI3_ENABLED == TRUE) && \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_SYSCLK)
  #define STM32_SPI3_FREQ                   STM32_SYSCLK_FREQ
#elif (STM32_SPI3_ENABLED == TRUE) && \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_HSI16)
  #define STM32_SPI3_FREQ                   STM32_HSI16_FREQ
#elif (STM32_SPI3_ENABLED == TRUE) && \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_MSIK)
  #define STM32_SPI3_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_SPI3_FREQ                   0U
#endif

/*--- Macros and checks for the FDCAN1 clock point. ------------------------*/

/**
 * @brief   FDCAN1 clock register bits.
 */
#if (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_HSE) || defined(__DOXYGEN__)
  #if (STM32_FDCAN1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN1_BITS               RCC_CCIPR1_FDCANSEL_HSE
  #else
    #define STM32_FDCAN1_BITS               0U
  #endif
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL1Q)
  #if (STM32_FDCAN1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN1_BITS               RCC_CCIPR1_FDCANSEL_PLL1Q
  #else
    #define STM32_FDCAN1_BITS               0U
  #endif
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL2P)
  #if (STM32_FDCAN1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN1_BITS               RCC_CCIPR1_FDCANSEL_PLL2P
  #else
    #define STM32_FDCAN1_BITS               0U
  #endif
#elif (STM32_FDCAN1_ENABLED == FALSE) &&                                    \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_IGNORE)
  #define STM32_FDCAN1_BITS                 0U
#else
  #error "invalid STM32_CFG_FDCAN1_SEL value specified"
#endif

/**
 * @brief   FDCAN1 clock clock point.
 */
#if ((STM32_FDCAN1_ENABLED == TRUE) && \
     (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_HSE)) || \
    defined(__DOXYGEN__)
  #define STM32_FDCAN1_FREQ                 STM32_HSE_FREQ
#elif (STM32_FDCAN1_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL1Q)
  #define STM32_FDCAN1_FREQ                 STM32_PLL1Q_FREQ
#elif (STM32_FDCAN1_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL2P)
  #define STM32_FDCAN1_FREQ                 STM32_PLL2P_FREQ
#else
  #define STM32_FDCAN1_FREQ                 0U
#endif

/*--- Macros and checks for the HCLKDIV8 clock point. ----------------------*/

/**
 * @brief   HCLKDIV8 clock register bits.
 */
#define STM32_HCLKDIV8_BITS                 0U

/**
 * @brief   HCLK divided by 8 clock clock point.
 */
#if (STM32_HCLKDIV8_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HCLKDIV8_FREQ               (STM32_HCLK_FREQ / 8U)
#else
  #define STM32_HCLKDIV8_FREQ               0U
#endif

/*--- Macros and checks for the SYSTICK clock point. -----------------------*/

/**
 * @brief   SYSTICK clock register bits.
 */
#if (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8) ||            \
    defined(__DOXYGEN__)
  #if (STM32_SYSTICK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SYSTICK_BITS              RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
  #else
    #define STM32_SYSTICK_BITS              0U
  #endif
#elif (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSI)
  #if (STM32_SYSTICK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SYSTICK_BITS              RCC_CCIPR1_SYSTICKSEL_LSI
  #else
    #define STM32_SYSTICK_BITS              0U
  #endif
#elif (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)
  #if (STM32_SYSTICK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SYSTICK_BITS              RCC_CCIPR1_SYSTICKSEL_LSE
  #else
    #define STM32_SYSTICK_BITS              0U
  #endif
#elif (STM32_SYSTICK_ENABLED == FALSE) &&                                   \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_IGNORE)
  #define STM32_SYSTICK_BITS                0U
#else
  #error "invalid STM32_CFG_SYSTICK_SEL value specified"
#endif

/**
 * @brief   SysTick clock clock point.
 */
#if ((STM32_SYSTICK_ENABLED == TRUE) && \
     (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8)) || \
    defined(__DOXYGEN__)
  #define STM32_SYSTICK_FREQ                STM32_HCLKDIV8_FREQ
#elif (STM32_SYSTICK_ENABLED == TRUE) && \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSI)
  #define STM32_SYSTICK_FREQ                STM32_LSI_FREQ
#elif (STM32_SYSTICK_ENABLED == TRUE) && \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)
  #define STM32_SYSTICK_FREQ                STM32_LSESYS_FREQ
#else
  #define STM32_SYSTICK_FREQ                0U
#endif

